bf7150 <- read_csv("bf/bf7150.csv")

af <- bf7150 |> 
  mutate(
    price = c(1395, 1426, 1370, 1380, 658, 661, 619, 543, 460, 515),   # 10年分
    N = 8416000,           # 発行済株式数
    beta = 1.0803,
    Pay_ratio = c(0.4946, 0.4299, 0.2924, 0.4520, 0.3431, 0, 0.1302, 0.3003, 0.2187, 0.2157),
    NP = N * price
  )

write_csv(af,"af/7150.csv")

ーーーーーーーーーーーーーーーーーーーーーーーーーー

bf7161 <- read_csv("bf/bf7161.csv")

af <- bf7161 |> 
  mutate(
    price = c(2290,1990,1980,1950,1250,1130,821,642,440,545),
    N = 72840263,
    beta = 0.3849,
    Pay_ratio = c(0.896, 0.8976, 0.8771,  0.9041, 0.8865, 0.7246, 1.0757, 1.8867, 0, 0),
    NP = N * price
  )

write_csv(af,"af/7161.csv")
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
bf8349 <- read_csv("bf/bf8349.csv")

af <- bf8349 |> 
  mutate(
    price = c(1570, 1580, 1580, 1513, 1111, 1027, 1125, 1006, 1026, 1170),
    N = 9509963,
    beta = 0.6125,
    Pay_ratio = c(0.3501, 0.2679, 0.2556, 0.4387, 0.3650, 0.3412, 0.4008, 0.3701, 0.3342, 0.3580),
    NP = N * price
  )

write_csv(af,"af/8349.csv")
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
bf8365 <- read_csv("bf/bf8365.csv")

af <- bf8365 |> 
  mutate(
    price = c(2500, 4440, 4500, 4360, 3095, 2412, 2944, 1791, 1764, 1695),
    N = 5444400,
    beta = 1.0889,
    Pay_ratio = c(0.2384, 0.2827, 0.2405, 0.2141, 0.1965, 0.3824, 0.5156, 0.8902, 0.2862, 0.4442),
    NP = N * price
  )

write_csv(af,"af/8365.csv")

ーーーーーーーーーーーーーーーーーーーーーーーーーーー
bf8383 <- read_csv("bf/bf8383.csv")

af <- bf8383 |> 
  mutate(
    price = c(2380, 2170, 1936, 1808, 1424, 1387, 1133, 1163, 1146, 1358),
    N = 9619398,
    beta = 0.5806,
    Pay_ratio = c(0.2586, 0.2667, 0.4340, 0.5135, 0.5989, 0.5236, 0.4829, 0.5389, 0.4658, 0.4506),
    NP = N * price
  )

write_csv(af,"af/8383.csv")

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
bf8416 <- read_csv("bf/bf8416.csv")

af <- bf8416 |> 
  mutate(
    price = c(1590, 1420, 1340, 1319, 740, 889, 722, 770, 716, 935 ),
    N = 10244800,
    beta = 0.8731,
    Pay_ratio = c(0.707, 0.932, 0.1322, 0.1730, 0.3535, 0.2356, 0.4178, 0.1878, 0.1958, 0.2475),
    NP = N * price
  )

write_csv(af,"af/8416.csv")

ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
bf8537 <- read_csv("bf/bf8537.csv")

af <- bf8537 |> 
  mutate(
    price = c(2210, 2460, 2630, 2520, 1781, 1672, 1339, 1360, 1254, 1282),
    N = 9671400,
    beta = 0.6017,
    Pay_ratio = c(0.3001, 0.1672, 0.1551, 0.1346, 0.1872, 0.4200, 0.3054, 0.2326, 0.3744, 0.2814),
    NP = N * price
  )

write_csv(af,"af/8537.csv")
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
bf8542 <- read_csv("bf/bf8542.csv")

af <- bf8542 |> 
  mutate(
    price = c(1780, 1740, 1585, 1558, 1081, 1074, 1060, 1070, 1045, 1155),
    N = 11679030,
    beta = 0.5599,
    Pay_ratio = c(0.3558, 0.3178, 0.3136, 0.4206, 0.5189, 0.5502, 0.4768, 0.4226, 0.3724, 0.4613),
    NP = N * price
  )

write_csv(af,"af/8542.csv")
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
bf8562 <- read_csv("bf/bf8562.csv")

af <- bf8562 |> 
  mutate(
    price = c(940, 960, 980, 944, 390, 273, 198, 235, 258, 235),
    N = 34900000,
    beta = 1.1149,
    Pay_ratio = c(0.1045, 0.1959, 0.4255, 0, 0.1390, 0.1358, 0 , 0.1693, 0.1769, 0.1245),
    NP = N * price
  )

write_csv(af,"af/8562.csv")
ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー

bf8563 <- read_csv("bf/bf8563.csv")

af <- bf8563 |> 
  mutate(
    price = c(1410, 2080, 1680, 1651, 601, 648, 639, 761, 681, 740),
    N = 12701000,
    beta = 0.8016,
    Pay_ratio = c(0.1426, 0.1532, 0.2764, 0.2986, 0.3195, 0.3742, 0.4017, 0.3294, 0.3121, 0.3131),
    NP = N * price
  )

write_csv(af,"af/8563.csv")

